{
    "base_model_name_or_path": "/VL-Pretrain/WiNGPT-VL-32B-10000",
    "bias": "none",
    "fan_in_fan_out": false,
    "inference_mode": true,
    "init_lora_weights": true,
    "lora_alpha": 256,
    "lora_dropout": 0.05,
    "modules_to_save": null,
    "peft_type": "LORA",
    "r": 128,
    "target_modules": [
      "self_attn.q_proj",
      "self_attn.k_proj",
      "self_attn.v_proj",
      "self_attn.o_proj",
      "mlp.gate_proj",
      "mlp.down_proj",
      "mlp.up_proj"
    ],
    "task_type": "CAUSAL_LM"
  }
